CREATE TABLE dota2_heroes (
    hero_id SERIAL PRIMARY KEY,
    hero_name VARCHAR(255) NOT NULL,
	  hero_photo_url VARCHAR(255),
    hero_description TEXT,
    hero_story TEXT,
    hero_voice_lines VARCHAR(255)
);

CREATE DOMAIN AbilityTarget AS TEXT CHECK (
  VALUE IN ('пасивна', 'вороже створіння', 'союзне створіння', 'націлена на точку', 'аура', 'перемикаючась', 'векторно направлена на створіння', 'ненаправлена', 'направлена на створіння або на точку', 'направлена на створіння на точку', 'автоматична')
);

CREATE DOMAIN DamageType AS TEXT CHECK (
  VALUE IN ('магічна', 'фізична', 'абсолютна')
);

CREATE TABLE hero_abilities (
    ability_id SERIAL PRIMARY KEY,
    hero_id INT REFERENCES dota2_heroes(hero_id),
    ability_name VARCHAR(255) NOT NULL,
  	ability_photo_url VARCHAR(255),
  	ability_description TEXT,
  	mana_cost VARCHAR(32),
    target_type AbilityTarget,
    damage_type DamageType,
    aganim_shard_buff TEXT,
    damage VARCHAR(32),
    duration VARCHAR(32),
    healing VARCHAR(32),
    is_active BOOLEAN,
    reduce_value VARCHAR(32)
);


-- INSERT

INSERT INTO dota2_heroes (hero_id, hero_name, hero_photo_url, hero_description, hero_story, hero_voice_lines)
VALUES
(	
	'1',
	'Pudge',
	'pudge.jpg',
	'Кожен вивірений кидок гака Пузаня вселяє страх у серця ворогів. Притягуючи ворогів до себе, він розчленовує їх своїм тесаком. З кожним убивством він збільшує свої здоров’я та шкоду й невдовзі стає нестримним убивцею.',
	'На Полях Одвічної Різанини, що далеко на південь від Квоїджу, щоночі невтомно працює огрядна постать — патрає, білує, скиртує кінцівки та нутрощі полеглих, аби до світання поле знову було готовим до нової крові. У цім проклятім краї ніщо саме не зогниє й не розкладеться; жоден мрець не стане прахом земним, як глибоко його не закопуй. Оточений птахами-падложерами, котрим до дзьоба влізає лишень пошматована плоть, м’ясник Пудж вправляється з лезами, які гострішають з кожним порубаним трупом. Хвись, хвись, гуп. Плоть відпадає від кісток, сухожилки та зв’язки рвуться, як мокрий папір. І з роками, окрім любові до м’ясницької справи, в Пуджа з’явився смак і до падла. Спершу кусень м’яса тут, трішки крові там… Невдовзі Пудж шматував зубами найтвердіших мерців, як пес розриває лахміття. І навіть ті, хто смерті не бояться, тремтять перед М’ясником.',
	'When I''m through with these vermin, they''ll be fit for a pie!'
)

INSERT INTO dota2_heroes (hero_id, hero_name, hero_photo_url, hero_description, hero_story, hero_voice_lines)
VALUES
(
	'2',
	'Witch Doctor',
	'witch_doctor.jpg',
	'Знахар — саме той, хто необхідний його команді. Він допоможе поступовим лікуванням чи приголомшенням і смертельним прокльоном ворогів, чи знищенням супротивників самотужки, у танці своєї ультимативної здібності. Мало хто може зрівнятися з різнобічністю Знахара.',
	'Жилавий, згорблений силует з нерівними кінцівками і незграбною ходою шкутильгає вперед, невтомно нишпорячи по полю бою у пошуках слабкого місця, де його здібності принесуть найбільше користі, і найбільше шкоди. Невідомо, що з ним сталося, але ніхто не сумнівається у могутності, що криється у його покрученому тілі. Гучними ударами довгого посоху по землі супроводжує знахар Жарвакко свій наступ, розгортаючи страхітливий арсенал амулетів, проклять і заклинань. Всю сукупність магічних знань, накопичених і вдосконалених за кілька життів на високогір’ях острова Арктура, він використовує проти своїх ворогів. Жарвакко може бути вашим найкращим другом або найлютішим ворогом, що зцілює союзників і знищує тих, хто виступає проти нього.',
)

INSERT INTO dota2_heroes (hero_id, hero_name, hero_photo_url, hero_description, hero_story, hero_voice_lines)
VALUES
(
	'3',
	'Spirit Breaker',
	'spirit_breaker.jpg',
	'Завжди в русі та сповнений агресії, Винищувач Духів носиться всією мапою, щоби розпочати бій зі своїми ворогами. З кожним оглушливим ударом його тяжкого ліхтаря він вибиває дух із ворогів. Вони можуть спробувати втекти, але за наявності на мапі кількох союзних вардів, Винищувач Духів не дасть їм такої нагоди.',
	'Баратрум, Винищувач Духів, — це горда і могутня істота, жорстокий чистий інтелект, який вирішив прослизнути у наш світ, щоби взяти участь у подіях, які можуть відбитися і на його рідному стихійному всесвіті. Для цього Баратрум зібрав собі тіло, яке могло слугувати йому і в нашому світі, і за його межами. Його фізична форма бере сили нашого світу, поєднуючи у собі форми бика та мавпи з рогами, копитами та руками, що є символами таких його якостей як сила, швидкість та спритність. Баратрум носить перстень у носі як нагадування про те, що він має служити своєму таємною наставнику, і про те, що світ, де він зараз перебуває, є лиш тінню справжнього.',
	'I''m the beast of many parts; I part enemies from their lives.'
)